In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('name2.csv')

In [3]:
df

     name  marks        city
0  shakib    345     kachina
1    anis     34     bhaluka
2  shohan    334  mymensingh

In [4]:
df['marks'].dtype

dtype('int64')

In [5]:
df['name'].dtype # 'O mean object'

dtype('O')

In [6]:
print(df['name'].dtype)

object

In [7]:
df['city'].dtype

dtype('O')

In [8]:
df = pd.DataFrame([[1,2,3,4], [5,6,7,8], [9,10,11,12], [13,14,15,16]], columns=['A', 'B', 'C', 'D'])

In [9]:
df

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [10]:
df.to_csv('success.csv', index=False)

In [11]:
df.tail(2)

    A   B   C   D
2   9  10  11  12
3  13  14  15  16

In [12]:
df2 = pd.DataFrame([[23,2,45,23],[45,6,56,45],[23,10,45,76],[546,14,76,877]], columns=['U', 'X', 'Y', 'Z'])

In [13]:
df2

     U   X   Y    Z
0   23   2  45   23
1   45   6  56   45
2   23  10  45   76
3  546  14  76  877

In [14]:
df3 = pd.merge(df, df2, right_on='X', left_on='B')

In [15]:
df3

    A   B   C   D    U   X   Y    Z
0   1   2   3   4   23   2  45   23
1   5   6   7   8   45   6  56   45
2   9  10  11  12   23  10  45   76
3  13  14  15  16  546  14  76  877